app/controllers/items_controller.rb

SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = 4 LIMIT 1
---
  def set_todo
    @todo = Todo.find(params[:todo_id])

SELECT `items`.* FROM `items` WHERE `items`.`todo_id` = 4
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo