app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT `todos`.* FROM `todos`

  def create
    @todo = Todo.create!(todo_params)
---
INSERT INTO `todos` (`name`, `created_at`, `updated_at`, `created_by`) VALUES ('dev perso', '2017-05-26 16:01:36', '2017-05-26 16:01:36', '3')

  def update
    @todo.update(todo_params)
---
UPDATE `todos` SET `name` = 'Lorem', `updated_at` = '2017-05-21 13:00:15' WHERE `todos`.`id` = 2

  def destroy
    @todo.destroy
---
DELETE FROM `todos` WHERE `todos`.`id` = 1

  def set_todo
    @todo = Todo.find(params[:id])
---
SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = 2 LIMIT 1