app/controllers/users_controller.rb

  def create
     @user = User.where('email' => :email)
     if @user == nil
      user = User.create!(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'rayed.benbrahim@gmail.com' LIMIT 1
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`, `name`) VALUES ('rayed.benbrahim@gmail.com', '$2a$10$1aNl//xL7v9h0/3wx5VVWuVDgkEX2FyOkI4n5OnSY/JsmRXgb1JOC', '2017-05-26 13:11:25', '2017-05-26 13:11:25', 'Rayed')